* 用户定义函数

* Scalar function的例子

In [5]:
%load_ext sql
%config SqlMagic.autocommit=True
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql use test1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [8]:
%%sql create function fn_getdeptno(@empid int)
    returns int
    begin
    return (select dept_no from employee
    where emp_id=@empid)
    end;
    
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [10]:
%%sql select * from employee
    where dept_no=dbo.fn_getdeptno(1001);

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000'))]

* 无参的标量函数

In [11]:
%%sql create function no_parameters()
    returns int
    as 
    begin
    return (select sum(salary) from employee)
    end;
    
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

* 这个函数被建在了Progammability --> scalar valued functions这里
* 调用无参函数的方法

In [13]:
%sql select dbo.no_parameters();

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(570000,)]

* 创建带参数的函数
* 一个拼名字的带参函数

In [14]:
%%sql create function full_name(@first_name varchar(50), @last_name varchar(50))
    returns varchar(200)
    as
    begin
    return (select @first_name + space(2) + @last_name)
    end;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

* 调用带参数的函数

In [16]:
%sql select dbo.full_name('Joe', 'Root');

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Joe  Root',)]

In [18]:
%sql select dbo.full_name('Joe', 'Root') as full_name;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[('Joe  Root',)]

* 修改函数，把sum改成avg

In [19]:
%%sql alter function no_parameters()
    returns int
    as 
    begin
    return (select avg(salary) from employee)
    end;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

* 工资比平均工资高的员工

In [21]:
%%sql select * from employee
    where salary>dbo.no_parameters();

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000'))]

* Inline Table - Valued Functions Example
* 做个中间视图

In [22]:
%%sql create function fn_GetEmployeeInfo(@empid int)
    returns table
    as
    return (
    select emp_id, first_name, last_name,
    mgr_id, phone_number, hire_date,
    job_title, dept_no
    from dbo.employee
    where
    emp_id=@empid
    );
    
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [24]:
%sql select * from fn_GetEmployeeInfo(1001);

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10)]

* Inline Table-Valued Functions 例子2

In [25]:
%%sql create function top_ten_customer()
    returns table
    as
    return (
    select top 10
    * from
    employee
    );
    
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [27]:
%sql select * from dbo.top_ten_customer();

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None),
 (1009, 'Alex', 'Fin', None, None, None, 'J7', 30, None)]

* 修改函数

In [28]:
%%sql alter function top_ten_customer()
    returns table
    as
    return (
    select top 5 *
    from
    employee
    );
    
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [30]:
%sql select * from dbo.top_ten_customer();

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', None, None, None, 'J7', 10, None),
 (1002, 'Scott', 'Tigger', 1001, None, None, 'J2', 10, None),
 (1003, 'Martin', 'Blake', 1001, None, None, 'J3', 10, None),
 (1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None)]

* 带参数的table-valued Function，是这样搞的

In [33]:
%%sql alter function top_ten_customer(@empid int)
    returns table
    as
    return (
    select top 5 *
    from employee
    where emp_id>@empid
    );
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [35]:
%sql select * from dbo.top_ten_customer(1003);

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1004, 'Arun', 'Turner', None, None, datetime.date(2008, 6, 5), 'J4', 20, Decimal('40000.0000')),
 (1005, 'John', 'Root', 1004, None, datetime.date(2010, 1, 10), 'J5', 20, None),
 (1006, 'Nithya', 'Jones', 1001, None, datetime.date(1999, 2, 12), 'J6', 30, Decimal('500000.0000')),
 (1007, 'Smith', 'Ruth', 1006, None, datetime.date(2010, 7, 21), 'J1', 10, Decimal('30000.0000')),
 (1008, 'Miller', 'Ward', 1001, None, None, 'J8', 40, None)]

* 多语句返回表的函数示例

In [37]:
%%sql create function fn_GetEmployeeInfo1(@dept_id integer)
    returns @retGetEmployeeInfo table(
    emp_id int primary key not null,
    first_name nvarchar(255) not null,
    last_name nvarchar(255) not null,
    dept_no int not null
    )
    as
    begin
    insert @retGetEmployeeInfo
    select emp_id,
    first_name,
    last_name,
    dept_no
    from employee
    where dept_no=@dept_id;
    return
    end;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [39]:
%sql select emp_id, first_name, last_name, dept_no from fn_GetEmployeeInfo1(10);

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[(1001, 'Allen', 'Finch', 10),
 (1002, 'Scott', 'Tigger', 10),
 (1003, 'Martin', 'Blake', 10),
 (1007, 'Smith', 'Ruth', 10)]